{
  "description" : "Access token to allow  the user to authorize API access. It can be generated from  the link 'https://secure.echosign.com/public/static/oauthDoc.jsp'. It must have scopes required by the corresponding samples to grant the API different levels of access to data on behalf of the end user.",
  "accessToken" : "",

  "description" : "First name of the user which will be passed while creating new user.",
  "userFirstName" : "Testing",

  "description" : "Last name of the user which will be passed while creating new user.",
  "userLastName" : "User",

  "description" : "Email address of the user which will be used as a sample user while running samples.",
  "userEmail" : "",

  "description" : "The userId or email of the user. If it is not specified, then the caller is inferred from the access token.",
  "xApiUser" : null,

  "description" : "The email address of the user whose details are being requested in getUsers method.",
  "xUserEmail" : null,

  "description" : "Prefix for the group name which will be added while creating group name at runtime using timestamp.",
  "groupName" : "SampleGroup",

  "description" : "Prefix for the agreement name which will be added while creating agreement name at runtime using timestamp.",
  "agreementName" : "SampleAgreement",

  "description" : "Prefix for the widget name which will be added while creating widget name at runtime using timestamp.",
  "widgetName" : "SampleWidget",

  "description" : "ExternalID for which agreement information is to be retrieved. ExternalId is passed while getting Agreements of the user.",
  "externalID" : null,

  "description" : "ExternalGroup for which agreement information is to be retrieved. ExternalId should be not null if user is passing ExternalGroup parameter.",
  "externalGroup" : null,

  "description" : "ExternalNameSpace for which agreement information is to be retrieved. ExternalId should be not null if user is initializing ExternalNameSpace parameter.",
  "externalNamespace" : null,

  "description" : "The query string used for the search. Multiple search terms can be provided, separated by spaces. Some of the search terms include document name, participant name or company, and form data.",
  "query" : null,

  "description" : "Name of the document with form fields to be used in creating a transient document with form fields.",
  "inputFormFieldFileName" : "DocumentWithFormFields.pdf",

  "description" : "Name of the sample document to be used in creating a transient document.",
  "inputFileName" : "Sample.pdf",

  "description" : "Path structure of directory containing resource files like Sample.pdf, DocumentWithFormFields.pdf, etc.",
  "requestPath" : "resources",

  "description" : "Path structure of parent directory containing output directories.",
  "outputPath" : "output",

  "description" : "Output directory for saving agreement documents.",
  "agreementDocument" : "agreementDocuments",

  "description" : "Output directory for saving audit trail of agreements.",
  "auditTrail" : "auditTrails",

  "description" : "Output directory for saving form data of widgets.",
  "formData" : "formData",

  "description" : "Mime type for pdf files.",
  "mimeTypePdf" : "application/pdf",

  "description" : "If an agreement has status 'OUT FOR SIGNATURE' for following number of days, reminder will be sent to the next participants of the agreement.",
  "waitingDays" : 1,

  "description" : "File offset while writing output in files.",
  "fileOffset" : 0,

  "description" : "The url where the end user will be redirected after successful completion of authorization. This value must belong to the set of values specified on the OAuth Configuration page.",
  "redirectUri" : "",

  "description" : "Value used to maintain state between the request and callback.",
  "state" : null,

  "description" : "Identifies the application configured on the OAuth Configuration page.",
  "clientId" : "",

  "description" : "Identifies the application configured on the OAuth Configuration page.",
  "clientSecret" : "",

  "description" : "Grant type for fetching the access token. Value must always be 'authorization_code'.",
  "accessTokenGrantType" : "authorization_code",

  "description" : "Grant type for refreshing the access token. Value must always be 'refresh_token'.",
  "refreshTokenGrantType" : "refresh_token",

  "description" : "Response type in the request for making authorization url used to fetch the access token. Value must always be 'code'.",
  "responseType" : "code",

  "description" : "Port for running local auth server",
  "oauthServerPortKey" : 9000,

  "description" : "This is the number of agreements for which the samples will run. Set -1/null for all agreements and 0 for no agreements.",
  "agreementCountLimit" : 1,

  "description" : "Relative path of keystore file for local server",
  "keyStoreFile" : "api/oAuth/server/key.pem",

  "description" : "Relative path of certificate file for local server",
  "certificateFile" : "api/oAuth/server/cert.pem",

  "description" : "Relative path of HTML file for local server",
  "oAuthHtmlFile" : "api/oAuth/server/oAuth.html",

  "description" : "Environment on which the sdk will run. If no Host Environment is provided here, default Host Environment [https://api.echosign.com/] will be used.",
  "envHostName" : "",

  "description" : "Prefix of email address which will be used for the sample use",
  "userEmailPrefix" : "",

  "description" : "Domain of email address which will be used for the sample use",
  "userEmailDomain" : ""
}

